Белгипрозем_2017/src/Documents/мАктирование/мАктирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мАктирование</name>
  <registerRecords>AccumulationRegister.Сметы</registerRecords>
  <registerRecords>AccumulationRegister.УчетПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент понижающий или повышающий</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеКоэффициента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>40</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеОсновноеПодразделение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>БазовоеНачисление</name>
      <comment>Сумма сделки без учета +/- коэф.</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Акт</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыРабот</name>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРабот</name>
      <type>
        <types>CatalogRef.мОбъектыРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаПрочих</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаЗИС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/мАктирование/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура НайтиАкт(Команда)
	НомерАкта = "";
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект, Параметры);
	ПоказатьВводЗначения(Оповещение,
	НомерАкта, "Укажите номер акта", Тип("Строка"));
КонецПроцедуры

&НаКлиенте
Процедура ПослеВводаЗначения(НомерАкта, Параметры) Экспорт
    Если НомерАкта <> Неопределено Тогда
		МассивМест = НайтиАктирование(НомерАкта);
		
		НайденоАктов = МассивМест.Количество();
		
		Если НайденоАктов = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не найдено ни одного акта с номером "+НомерАкта;
			Сообщение.Сообщить(); 
			Возврат;
			
		ИначеЕсли НайденоАктов = 1 Тогда
			Место = МассивМест[0];
		Иначе
			// уточнение номера акта
			СпАктов = Новый СписокЗначений;
			Для каждого Место Из МассивМест Цикл
				СпАктов.Добавить(Место, Место.НомерАкта);
			КонецЦикла;
			ИскМесто = СпАктов.ВыбратьЭлемент("Выберите номер акта");
			Если ИскМесто = Неопределено Тогда
				Возврат;
			КонецЕсли; 
			Место = ИскМесто.Значение;
		КонецЕсли; 
		
		ПараметрыФормы = Новый Структура("Ключ", Место.Документ);
		ПараметрыФормы.Вставить("НомерАкта", Место.НомерАкта);
		ПараметрыФормы.Вставить("НомерСтроки", Место.НомерСтроки);
		ОткрытьФорму("Документ.мАктирование.ФормаОбъекта", ПараметрыФормы, ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
    КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НайтиАктирование(НомерАкта) 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	мАктированиеАкты.НомерАкта КАК НомерАкта,
		|	мАктированиеАкты.Ссылка КАК Документ,
		|	мАктированиеАкты.НомерСтроки
		|ИЗ
		|	Документ.мАктирование.Акты КАК мАктированиеАкты
		|ГДЕ
		|	НЕ мАктированиеАкты.Ссылка.ПометкаУдаления
		|	И мАктированиеАкты.НомерАкта Подобно &НомерАкта";
	
	Запрос.УстановитьПараметр("НомерАкта", "%"+НомерАкта+"%");
	
	Результат = Запрос.Выполнить();
	
	МассивМест = Новый Массив;
	
	Если Результат.Пустой() Тогда
		Возврат МассивМест;
	КонецЕсли; 
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Место = Новый Структура("Документ, НомерСтроки, НомерАкта", Выборка.Документ, Выборка.НомерСтроки, Выборка.НомерАкта); 
		МассивМест.Добавить(Место);
	КонецЦикла;
	Возврат МассивМест;
КонецФункции

&НаКлиенте
Процедура СоздатьАктирование(Команда)
	ОткрытьФорму("Обработка.мСоздатьАктирование.Форма.Форма");
КонецПроцедуры
